trade_exp/src/Catalogs/ТехническиеРесурсыСклада/ТехническиеРесурсыСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2bcf9c4e-6b00-4658-aa8e-7f72e66c03d4">
  <name>ТехническиеРесурсыСклада</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ТехническиеРесурсыСкладов/ТехническиеРесурсыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="459cbc34-daa7-4457-960b-889934bd0867">
  <name>ТехническиеРесурсыСкладов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="e5bd11eb-ff46-43b2-b19d-1abf09757c92">
    <name>ДопустимоеКоличество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="26a9a065-c0c5-416f-8580-8e7b6fbf61cb">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79aa1ba0-664e-4001-88f2-a98d06189413">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ТехническиеРесурсыСклада/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	 //заполнение тч ресурсов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТехническиеРесурсыСкладов.Склад КАК Склад,
		|	ТехническиеРесурсыСкладов.ДопустимоеКоличество КАК КоличествоРесурса
		|ИЗ
		|	РегистрСведений.ТехническиеРесурсыСкладов КАК ТехническиеРесурсыСкладов
		|ГДЕ
		|	ТехническиеРесурсыСкладов.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Оборудование", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрТабРесурсы = РесурсыПоСкладам.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТабРесурсы, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Модифицированность Тогда
		ЗаписатьДанныеВРегистрРесурсов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВРегистрРесурсов()

	НаборЗаписей = РегистрыСведений.ТехническиеРесурсыСкладов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Оборудование.Установить(Объект.Ссылка);
	НаборЗаписей.Очистить();
	Для ит=0 по ит<РесурсыПоСкладам.Количество()-1 Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Оборудование = Объект.Ссылка;
		НоваяЗапись.Склад = РесурсыПоСкладам[ит].Склад;
		НоваяЗапись.ДопустимоеКоличество = РесурсыПоСкладам[ит].КоличествоРесурса;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // ЗаписатьДанныеВРегистрРесурсов()

&НаКлиенте
Процедура РесурсыПоСкладамПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
